Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: The Fan Out attribute specifies how many split ends there are.
ru_ru: Атрибут Веерный выход определяет, сколько должно быть разъединённых концов.

source: Next: Testing multiple files.
ru_ru: Далее: Проверка нескольких файлов.

source: The minuend of the subtraction; that is, the number from which to subtract.
ru_ru: Уменьшаемое вычитания, то есть число, из которого вычитать.

source: And the Legacy option draws diagonal lines to each split end, without labels; this option is primarily for compatibility with versions older than 2.7.0, when this was the only option for splitter appearance.
ru_ru: Вариант Устаревший отрисовывает диагональные линии к каждому разъединённому концу, без меток; этот вариант в основном для совместимости с версиями, более старыми, чем 2.7.0, когда это был единственный вариант внешнего вида разветвителя.

source: For example, if you distribute copies of such a program, whether gratis or for a fee, you must give the recipients all the rights that you have.
ru_ru: Например, если вы распространяете копии такой программы бесплатно или за вознаграждение, вы должны предоставить получателям все права, которыми вы обладаете.

source: The precise terms and conditions for copying, distribution and modification follow.
ru_ru: Ниже следуют точные определения и условия для копирования, распространения и модификации.

source: This probing feature is helpful for debugging circuits using wire bundles.
ru_ru: Эта возможность исследования полезна для отладки схем, использующих пучки проводов.

source: A full description of the analysis process is described in the Combinational Analysis section.
ru_ru: Полное описание процесса анализа расположено в разделе Комбинационный анализ.

source: The last (rightmost) vertical area lists those components that have been selected.
ru_ru: Последняя (крайняя правая) вертикальная область содержит список тех компонентов, которые были выбраны.

source: (In fact, detecting sequential circuits is provably impossible, as it would amount to solving the Halting Problem.
ru_ru: (На самом деле, выявление последовательностных схем доказуемо невозможно, поскольку это будет означать решение проблемы остановки.

source: An additional output of the priority encoder is 1 whenever the priority encoder is enabled and finds a 1 on one of the indexed inputs.
ru_ru: Дополнительный выход шифратора приоритетов содержит 1 всякий раз, когда шифратор приоритетов включен и находит 1 на одном из нумерованных входов.

source: A tunnel acts like a wire in that it binds points together, but unlike a wire the connection is not explicitly drawn.
ru_ru: Тоннель действует как провод в том смысле, что он соединяет точки вместе, но в отличие от провода соединение не отрисовывается явно.

source: Split ends (input/output, bit width computed based on Bit x attributes)
ru_ru: Разделённые концы (вход/выход, разрядность вычисляется на основе атрибутов Бит x)

source: Logisim organizes tools into libraries.
ru_ru: Logisim организует инструменты в библиотеки.

source: Logisim is open-source software.
ru_ru: Logisim - это программа с открытым исходным кодом.

source: Beyond the sequence of examples provided here, the Logisim source code provides copious additional examples, though they do not always illustrate the same attention to readability and good design.
ru_ru: Помимо ряда примеров, приведённых здесь, исходные коды Logisim предоставляют много дополнительных примеров, хотя они не всегда иллюстрируют ту же заботу об удобочитаемости и хорошем дизайне.

source: Brings the respective window to the front.
ru_ru: Выводит соответствующее окно на передний план.

source: The initial seed is user-configurable.
ru_ru: Начальное семя может быть настроено пользователем.

source: The Build Circuit dialog includes two options.
ru_ru: Диалоговое окно Построить схему включает две опции.

source: Arithmetic
ru_ru: Арифметика

source: The component is designed so that it can be cascaded with other dividers to provide support a dividend with more bits than is possible with a single divider: The upper input provides the upper dataBits bits of the dividend (if it is specified at all), and the rem bits provide the remainder, which can be fed as the upper input into another divider.
ru_ru: Компонент разработан таким образом, что его можно включать каскадно с другими делителями чтобы обеспечить деление с большим количеством битов, чем возможно с одним делителем: вход upper предоставляет старшие битыДанных битов делимого (если оно вообще задано), а биты rem предоставляют остаток, который может быть подан на вход upper другого делителя.

source: * in initiating a poke.
ru_ru: * инициировать нажатие.

source: An output will match the west input if its number matches the value currently received through the select input on the south; otherwise, its value will be either all-zeroes or all-floating, depending on the value of the Three-State?
ru_ru: Значение на выходе будет равно значению на западном входе, если его номер совпадает со значением, принятым в данный момент на выбирающем входе на юге, в противном случае значения на его выходах будут либо нулевые, либо плавающие, в зависимости от значения атрибута Три состояния?

source: Note that the input pins both contain 0s; and so does the output pin.
ru_ru: Обратите внимание, что на обоих входных контактах нули; и на выходном контакте тоже.

source: Next: The File tab.
ru_ru: Далее: Вкладка Файл.

source: To distinguish the several connecting points for a splitter, we refer to the single connecting point one side as its combined end, and we refer to the multiple connecting points on the other side as its split ends.
ru_ru: Чтобы отличать разные точки подключения разветвителя, мы будем называть одиночную точку подключения с одной из его сторон объединённым концом, а множественные точки подключения на другой стороне - разделёнными концами.

source: (If seed is 0, this new seed should be different from the initial seed used previously.)
ru_ru: (Если семя - 0, то новое семя будет отличаться от начального семени, использованного перед этим.)

source: Edit Circuit Layout
ru_ru: Редактировать чертёж схемы

source: The Toolbar tab allows you to configure what tools appear in the toolbar.
ru_ru: Вкладка Панель инструментов позволяет вам настраивать, какие инструменты появятся на пенели инструментов.

source: Outputs the value currently stored by the register.
ru_ru: Выдаёт значение, хранящееся в данный момент в регистре.

source: As you place each component of the circuit, you'll notice that as soon as the component is placed, Logisim reverts to the Edit tool so that you can move the recently-placed component or (as we'll see soon) connect the component to others by creating wires.
ru_ru: Когда вы размещаете каждый компонент, вы заметите, что как только компонент размещён, Logisim возвращается к Инструменту Правка, так что вы можете двигать размещённый компонент, или (как мы скоро увидим) соединить компонент с другими, создавая провода.

source: West edge, lower pin labeled ct (input, bit width 1)
ru_ru: Западный край, нижний контакт, отмечен ct (вход, разрядность равна 1)

source: A group of bits from the data value, as selected by the select input.
ru_ru: Группа битов из входных данных, определённая выбирающим входом.

source: None.
ru_ru: Нет.

source: The bit width of the input(s).
ru_ru: Разрядность входа (входов).

source: Next: Debugging subcircuits.
ru_ru: Далее: Отладка подсхем.

source: Beta 1 (in Base library, moved to Wiring in 2.7.0)
ru_ru: Beta 1 (в библиотеке Базовые, перемещён в библиотеку Проводка в 2.7.0)

source: EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
ru_ru: ЗА ИСКЛЮЧЕНИЕМ ТЕХ СЛУЧАЕВ, КОГДА ПРОТИВНОЕ ЗАЯВЛЕНО В ПИСЬМЕННОЙ ФОРМЕ, ДЕРЖАТЕЛИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИЕ СТОРОНЫ ПОСТАВЛЯЮТ ПРОГРАММУ "КАК ОНА ЕСТЬ" БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ.

source: Minimizes (iconifies) the current window.
ru_ru: Минимизирует (сворачивает в значок) текущее окно.

source: This component divides two values coming in via the west inputs and outputs the quotient on the east output.
ru_ru: Этот компонент делит два значения, поступающие на западные входы и выдаёт частное на восточный выход.

source: Here, we create an additional circuit within the testing file that contains our solution circuit.
ru_ru: В таком случае мы создаём дополнительную схему в проверяющем файле, содержащем схему с решением.

source: With multiple components selected, attributes shared by all are shown, blank if they have different values and otherwise with the value they all have in common.
ru_ru: Если несколько компонентов выбраны, то атрибуты, общие для всех, будут показаны: пустыми, если они имеют разные значения, в противном случае - с общими для них значениями.

source: Stores the contents of memory.
ru_ru: Хранит содержимое памяти.

source: West edge, other labeled pin(s) (input(s), bit width 1)
ru_ru: Западный край, другой отмеченный контакт(ы) (вход(ы), разрядность равна 1)

source: Select the Input tool (), and place the pins down.
ru_ru: Выберите инструмент Добавить входной контакт () и разместите контакты.

source: The final tab displays a minimized expression corresponding to a column of the truth table.
ru_ru: Последняя вкладка отображает минимизированное выражение, соответствующее столбцу таблицы истинности.

source: If you've edited the circuit's appearance, this menu item reverts the appearance back to the default rectangle-with-notch appearance.
ru_ru: Если вы изменили внешний вид схемы, то этот пункт меню вернёт внешний вид по умолчанию: прямоугольник с выемкой.

source: GNU General Public License
ru_ru: Универсальная Общественная Лицензия GNU

source: trigger action
ru_ru: вызываемое действие

source: It is very idealized, so that a pair of NOR gates in an S-R latch configuration will toggle in lockstep infinitely, rather than the circuit eventually settle into a stable state.
ru_ru: Он очень идеализирован, так что пара элементов ИЛИ-НЕ в схеме S-R триггера будет переключаться "нога в ногу" бесконечно, вместо того, чтобы схема со временем пришла к стабильному состоянию.

source: The upper dataBits bits of the dividend (that is, the first operand for the division).
ru_ru: Старшие битыДанных битов делимого (то есть первый операнд деления).

source: If checked, circuits viewed will be "live:" That is, the values propagating through the circuit will be updated with each poke or change to the circuit.
ru_ru: Если установлено, то просматриваемая схема будет "живой": то есть значения, просчитываемые для схемы будут обновляться при каждом нажатии или изменении схемы.

source: Indicates how false and true results should be translated into output values.
ru_ru: Указывает, как результаты "ложь" и "истина" будут переведены в выходные значения.

source: Just below the selector will appear the expression formatted in a particularly common notation, where an OR is represented as addition, an AND is represented as multiplication, and a NOT is denoted with a bar above the portion affected by the NOT.
ru_ru: Чуть ниже списка появится выражение, отформатированное в довольно общепринятых обозначениях, где ИЛИ представляется в виде сложения, И - как умножение, а НЕ обозначается чертой над той частью, для которой вычисляется НЕ.

source: If the values subtracted as unsigned values yield a negative value, then this bit will be 1; otherwise, it will be 0.
ru_ru: Если значения вычитаются как беззнаковые и дают отрицательное значение, то этот бит будет 1; в противном случае - 0.

source: West edge (inputs, bit width matches Data Bits attribute)
ru_ru: Западный край (входы, разрядность соответствует атрибуту Биты данных)

source: // However, if the context says not to show state (as when generating
ru_ru: // Впрочем, если по контексту показывать состояние не надо (при составлении

source: Note that if you are using shaped gates, the west side of XOR and XNOR gates will be curved.
ru_ru: Заметьте, что если вы используете фигурные элементы, то западный край элементов Исключающее ИЛИ и Исключающее ИЛИ-НЕ будет искривлён.

source: // and the copied refer to the same Value objects.
ru_ru: // и оригинал ссылаются на одни и те же объекты Value.

source: The Clear button clears the text pane, and the Revert button changes the pane back to representing the current expression.
ru_ru: Кнопка Очистить очищает текстовое поле, а кнопка Вернуть меняет поле обратно к представлению текущего выражения.

source: You could also mix the operators.
ru_ru: Кроме того, можно смешивать операторы.

source: Memory
ru_ru: Память

source: Next: Step 0: Orienting yourself
ru_ru: Далее: Шаг 0: Осваиваемся

source: The distinction between Unique and Recursive is explained further under Project menu section.
ru_ru: Различие между Уникальных и Рекурсивно объясняется в разделе Меню Проект.

source: Available only when editing a circuit's appearance, this menu item lowers the currently selected object(s) so that all other objects are drawn on top of them.
ru_ru: Доступный только при редактировании внешнего вида схемы, этот пункт меню опускает выделенный в данный момент объект(ы) так, чтобы все другие объекты оказались над ним.

source: An N-type transistor behaves very similarly to a Controlled Buffer.
ru_ru: Транзистор n-типа ведёт себя очень похоже на Управляемый буфер.

source: The two-input truth table for the gates is the following.
ru_ru: Двухвходовая таблица истинности для элементов следующая.

source: Before Logisim opens the window, it will compute Boolean expressions and a truth table corresponding to the circuit and place them there for you to view.
ru_ru: Перед тем, как открыть окно, Logisim вычислит логические выражения и таблицу истинности, соответствующие схеме, и разместит их в нём для просмотра.

source: GNU GENERAL PUBLIC LICENSE
ru_ru: УНИВЕРСАЛЬНАЯ ОБЩЕСТВЕННАЯ ЛИЦЕНЗИЯ GNU

source: It does not interact with values traveling through the circuit in any way, except inasmuch as it will be visible when the circuit is drawn.
ru_ru: Она никаким образом не взаимодействует со значениями, проходящими через схему, за исключением того, что она будет видна, когда схема отрисована.

source: Clear Contents: Resets all values in memory to 0.
ru_ru: Очистить содержимое: сбрасывает все значения памяти на 0.

source: Highest-order 0
ru_ru: Старший 0

source: The bit width of the data input and of the output.
ru_ru: Разрядность входа данные и выхода компонента.

source: /** Draws an indicator that the caret is being selected.
ru_ru: /** Рисует индикатор того, что указатель был выбран.

source: The inputs are counted top-down if the facing is east or west, and they are counted left-to-right if the facing is north or south.
ru_ru: Входы считаются сверху вниз, если компонент направлен на восток или запад, и считаются слева направо, если он направлен на север или юг.

source: Highest-order 1
ru_ru: Старший 1

source: West edge, south end (input, bit width matches Data Bits attribute)
ru_ru: Западный край, южный конец (вход, разрядность соответствует атрибуту Биты данных)

source: The bit width of the component's data input.
ru_ru: Разрядность входа данных компонента.

source: Printer View: Whether to use "printer view" in exporting the circuits.
ru_ru: Вид для печати: следует ли использовать "вид для печати" при экспорте схем.

source: In this case, the resistor pulls the wire to which it is connected toward the value indicated in its Pull Direction attribute.
ru_ru: В этом случае резистор меняет значение на проводе, к которому он подключен, на значение, указанное в его атрибуте Направление согласования.

source: For example, we might first poke the bottom input.
ru_ru: Например, мы можем нажать сначала на нижний вход.

source: You can edit the expression in the text pane and click the Enter button to make it take effect; doing this will also update the truth table to make it correspond.
ru_ru: Вы можете изменить выражение в текстовом поле и нажать кнопку Ввести, чтобы изменения вступили в силу; это также обновит таблицу истинности для соответствия.

source: West edge, upper pin (input, bit width 7)
ru_ru: Западный край, верхний контакт (вход, разрядность равна 7)

source: Note that any change to the Fan Out or Bit Width In attributes will reset all Bit x attributes so that they will distribute the bits of the combined value as evenly as possible among the split ends.
ru_ru: Обратите внимание, что любые изменения атрибутов Веерный выход или Разрядность входа сбросят все атрибуты Бит x так, чтобы биты значения на объединённом конце были как можно более равномерно распределены между разделёнными концами.

source: Although templates are useful in other situations also, they are particularly suited for classroom use, where an instructor might want to distribute a template for students to start from.
ru_ru: Хотя шаблоны полезны и в других ситуациях, они особенно хорошо подходят для использования в классе, где преподавателю может потребоваться распространить учащимся шаблон, с которого нужно начинать.

source: Everyone is permitted to copy and distribute verbatim copies
ru_ru: Всем разрешается копировать и распространять дословные копии

source: I/O: Components that exist for the purpose of interacting with the user.
ru_ru: Ввод/вывод: компоненты для взаимодействия с пользователем.

source: For these windows, the project-specific menu items will be disabled.
ru_ru: Для этих окон специфичные для проекта элементы меню будут отключены.

source: If there is an output pin labeled with the special word halt, its output is not displayed — but once the pin's value reaches 1 after a propagation is completed, Logisim ends the simulation.
ru_ru: Если есть выходной контакт, помеченный специальным словом halt, то значение на нём не выводится, но как только оно становится 1 после завершения просчёта, Logisim завершает моделирование.

source: 1 or z
ru_ru: 1 или z

source: Selecting a component, though, will display its attributes.
ru_ru: Выбор компонента, впрочем, покажет его атрибуты.

source: D/T/JK/SR Flip-Flop
ru_ru: D/T/JK/SR триггер

source: To connect the upper input to the NOT gate and the AND gate, then, I added three different wires.
ru_ru: Чтобы соединить верхний вход с элементом НЕ, а затем с элементом И, я добавил три разных провода.

source: (If one of the tunnels were labeled something else, like b, then it would be part of a different set of tunnels.) The controlled buffer at top emits a floating output since its lower input is 0.
ru_ru: (Если бы один из тоннелей был помечен как-то иначе, например b, то он был бы частью другой совокупности тоннелей.) Управляемый буфер наверху выдаёт плавающее значение, поскольку на его нижнем входе 0.

source: The Wiring library includes components that relate primarily to wires and to basic electrical concepts.
ru_ru: Библиотека проводка включает в себя компоненты, которые относятся в основном к проводам и базовым понятиям электроники.

source: Next: Tool attributes.
ru_ru: Далее: Атрибуты инструментов.

source: The lower dataBits bits of the quotient, as specified above.
ru_ru: Младшие битыДанных битов частного, как указано выше.

source: This option will therefore be disabled if any outputs' expressions contain XORs.
ru_ru: Эта опция будет отключена, если любые выходные выражения содержат Исключающее ИЛИ.

source: Next: Shortcomings.
ru_ru: Далее: Недостатки.

source: The side of the component where its output pin should be.
ru_ru: Сторона компонента, где должен быть его выходной контакт.

source: Simulation Enabled
ru_ru: Моделирование включено

source: Generally speaking, the constructed circuit will be attractive; and, indeed, one application of Logisim's Combinational Analysis module is to beautify poorly drawn circuits.
ru_ru: Вообще говоря, построенные схемы будут привлекательными; и, по сути, одно из применений модуля Комбинационный анализ в Logisim - украшение плохо нарисованных схем.

source: But why quit now?
ru_ru: Но зачем выходить сейчас?

source: The clock triggers are enabled when this input is 1 or undefined.
ru_ru: Срабатывания тактового входа включаются, когда значение этого входа 1 или не определено.

source: Base library
ru_ru: Библиотека Базовые

source: I welcome corrections from experts.
ru_ru: Я приветствую корректировки со стороны экспертов.

source: ld on south edge (input, bit width 1)
ru_ru: ld на южном крае (вход, разрядность равна 1)

source: Displays a summary of the command line options.
ru_ru: Отображает список параметров командной строки.

source: The multiplicand (that is, the first of the two numbers to multiply).
ru_ru: Множимое (то есть первое из двух чисел для перемножения).

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
ru_ru: Вышеупомянутый копирайт и данные условия должны быть включены во все копии или значимые части данного Программного Обеспечения.

source: A tunnel has only one pin, whose bit width matches the tunnel's Data Bits attribute.
ru_ru: Тоннель имеет только один контакт, разрядность которого соответствует атрибуту Биты данных тоннеля.

source: Here, a NOT is represented with a tilde ('~').
ru_ru: Здесь НЕ представляется как тильда ('~').

source: For example, 8 Hz means that ticks will occur eight times a second.
ru_ru: Например, 8 Гц означает, что такты будут происходить 8 раз в секунду.

source: With its simple toolbar interface and simulation of circuits as they are built, it is simple enough to facilitate learning the most basic concepts related to logic circuits.
ru_ru: Благодаря простому интерфейсу панели инструментов и моделированию схем по ходу их проектирования, Logisim достаточно прост, чтобы облегчить изучение основных понятий, связанных с логическими схемами.

source: (Determining whether two arbitrary objects overlap is difficult.
ru_ru: (Определение перекрытия двух произвольных объектов сложно.

source: For instance, if the 14-bit input is 111x10110x1101, then the output must be at least 9 (if the x's are interpreted as zeroes) and at most 11 (if they are interpreted as ones).
ru_ru: Например, если на 14-битном входе 111x10110x1101, то на выходе должно быть не менее 9 (если x-ы интерпретируются как нули) и не более 11 (если они интерпретируются как единицы).

source: North edge, first from left (input, bit width 1)
ru_ru: Северный край, первый слева (вход, разрядность равна 1)

source: Number of Inputs
ru_ru: Количество входов

source: If either of the addends contains some floating bits or some error bits, then the component will perform a partial addition.
ru_ru: Если какое-либо слагаемое содержит несколько плавающих битов или несколько битов с ошибкой, то компонент выполнит частичное сложение.

source: Export Image...
ru_ru: Экспортировать изображение...

source: * and modify them all at once.
ru_ru: * и изменять их все сразу.

source: The subtrahend of the subtraction; that is, the number to subtract from the minuend.
ru_ru: Вычитаемое вычитания, то есть число, которое нужно вычесть из уменьшаемого.

source: a) Accompany it with the complete corresponding machine-readable
ru_ru: a) Сопроводите ее полным соответствующим машиночитаемым
